cases/ToyProblem1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
160000
(
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
(0 -0.166509148108729 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0 -0.394688351072542 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    sides
    {
        type            cyclic;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
